<h1>Working with different type of file</h1>

**Content :**

- Data Engineering
- Data Engineering Process
- Working with different file format
- Data Analysis

**Data engineering**, is one of the most critical skills in any data scientist skills

**Data Engineering Process**\
There several steps in data engineering process:
- **Extract :** Data extraction is the fact of getting data from multiple sources. Ex : Data extraction from website using web scraping or gathering information from data that stored in different file \format (Json, Csv, XML, ect ..)

- **Tranform :** Tranforming the data means remove the data that we don't need for further analysis \
and converting data in the format that all the data from the multiple sources is in the same format.

- **Format :** loading data in the datawarehouse.  Data warehouse essantially contains large volume  of data that are accessed to gather insights.

<h3>Reading data from CSV in python</h3>

In [ ]:
import pandas as pd
import requests

In [23]:
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv"

# Define Download funtion
def download(url, filename):
    response = requests.get(url)
    if response.status_code == 200:
        try:
            with open(filename,"wb") as file:
                file.write(response.content)
        except IOError:
            print("Unable to open or write data in the file")
        else:
            print("The file has been successfully open")

download(filename,"addresses.csv")

The file has been successfully open

In [50]:
df = pd.read_csv("addresses.csv", header=None)
df

,0,1,2,3,4,5
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [51]:
# Adding colunms name to the df
df.columns = ['First Name', 'Last Name', 'Location', 'City', 'State', 'Area Code']
df

,First Name,Last Name,Location,City,State,Area Code
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [59]:
# selection locatrion where location equal '120 jeffereson st'
df_warriors = df[df["Location"] == '120 jefferson st.']
df_warriors

  First Name Last Name           Location       City State  Area Code
0       John       Doe  120 jefferson st.  Riverside    NJ       8075

In [60]:
#selection row using iloc and loc
df.loc[0:4, 'Location']

0                   120 jefferson st.
1                        220 hobo Av.
2                   120 Jefferson St.
3    7452 Terrace "At the Plaza" road
4                                 NaN
Name: Location, dtype: object

In [64]:
#selection row using iloc and loc
df.iloc[:,1:4:2]

  Last Name         City
0       Doe    Riverside
1  McGinnis        Phila
2    Repici    Riverside
3     Tyler     SomeTown
4  Blankman     SomeTown
5       Jet  Desert City

In [65]:
# To select the 0th,1st and 2nd row of "First Name" column only
df.iloc[[0,1,2], 0]

0             John
1             Jack
2    John "Da Man"
Name: First Name, dtype: object

<h5>Transform function in Pandas</h5>

In [66]:
import numpy as np

In [67]:
# Creating a dataframe
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns=['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [68]:
# Let's add 10 to each element in the Dataframe
df = df.transform(func = lambda x : x + 10)
df

    a   b   c
0  11  12  13
1  14  15  16
2  17  18  19

In [69]:
#Use DataFrame.transform() function to find the square root to each element
result = df.transform(func = ['sqrt'])
result

          a         b         c
       sqrt      sqrt      sqrt
0  3.316625  3.464102  3.605551
1  3.741657  3.872983  4.000000
2  4.123106  4.242641  4.358899

<h5>Transform function in Pandas</h5>

In [70]:
import json

In [78]:
# Let's create a dictionnary

person = {
    'first_name' : 'Mark',
    'last_name' : 'abc',
    'age' : 27,
    'address': {
        "streetAddress": "21 2nd Street",
        "city": "New York",
        "state": "NY",
        "postalCode": "10021-3100"
    }
}

print(type(person))

<class 'dict'>

**dump() method**, use to convert the Python objects into their respective JSON object.
Parameters:

    dictionary – name of the dictionary which should be converted to JSON object.
    file pointer – pointer of the file opened in write or append mode.

In [73]:
try:
    with open("person.json",'w') as f: # writing json object
        json.dump(person, f)
except IOError:
    print("File Error")

Serialization uising dumps() method, that helps to convert a dictionnary to a json object.
It takes two parameters:

    dictionary – name of the dictionary which should be converted to JSON object.
    indent – defines the number of units for indentation

In [74]:
# Serializing json  
json_object = json.dumps(person, indent = 4) 
  
# Writing to sample.json 
with open("sample.json", "w") as outfile: 
    outfile.write(json_object)

In [75]:
# read the json file
try:
    with open("sample.json", 'r') as file:
        content_json = json.load(file)
except IOError:
    print("Impossible to open this file")
else:
    print(json_object) 
    print(type(json_object))

{
    "first_name": "Mark",
    "last_name": "abc",
    "age": 27,
    "address": {
        "streetAddress": "21 2nd Street",
        "city": "New York",
        "state": "NY",
        "postalCode": "10021-3100"
    }
}
<class 'str'>

<h5>XLSX file format</h5>

In [79]:
# Reading data from XSLX file
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/file_example_XLSX_10.xlsx"

download(filename,"file_example_XLSX_10.xlsx")

The file has been successfully open

In [80]:
df = pd.read_excel("file_example_XLSX_10.xlsx")
df.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

<h5>XML file format</h5>

In [81]:
import xml.etree.ElementTree as ET

# create the file structure
employee = ET.Element('employee')
details = ET.SubElement(employee, 'details')
first = ET.SubElement(details, 'firstname')
second = ET.SubElement(details, 'lastname')
third = ET.SubElement(details, 'age')
first.text = 'Shiv'
second.text = 'Mishra'
third.text = '23'

In [82]:
# create a new XML file with the results
mydata1 = ET.ElementTree(employee)
# myfile = open("items2.xml", "wb")
# myfile.write(mydata)
with open("new_sample.xml", "wb") as files:
    mydata1.write(files)

<h5>Reading with xml.etree.ElementTree</h5>

In [83]:
# Not needed unless running locally
# !wget https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/Sample-employee-XML-file.xml

import xml.etree.ElementTree as etree

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/Sample-employee-XML-file.xml"

download(filename, "Sample-employee-XML-file.xml")

The file has been successfully open

In [84]:
# Parse the XML file
tree = etree.parse("Sample-employee-XML-file.xml")

# Get the root of the XML tree
root = tree.getroot()

# Define the columns for the DataFrame
columns = ["firstname", "lastname", "title", "division", "building", "room"]

# Initialize an empty DataFrame
datatframe = pd.DataFrame(columns=columns)

# Iterate through each node in the XML root
for node in root:
    # Extract text from each element
    firstname = node.find("firstname").text
    lastname = node.find("lastname").text
    title = node.find("title").text
    division = node.find("division").text
    building = node.find("building").text
    room = node.find("room").text
    
    # Create a DataFrame for the current row
    row_df = pd.DataFrame([[firstname, lastname, title, division, building, room]], columns=columns)
    
    # Concatenate with the existing DataFrame
    datatframe = pd.concat([datatframe, row_df], ignore_index=True)

In [85]:
datatframe

  firstname lastname      title  division building room
0      Shiv   Mishra   Engineer  Computer      301   11
1       Yuh    Datta  developer  Computer      303   02
2     Rahil     Khan     Tester  Computer      304   10
3      Deep   Parekh   Designer  Computer      305   14

<h5>Reading xml file using pandas.read_xml function</h5>

In [87]:
df=pd.read_xml("Sample-employee-XML-file.xml", xpath="/employees/details")

In [88]:
datatframe.to_csv("employee.csv", index=False)